SmsDaemon/SendSmsServiceSoapBinding.sendFailed.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://service.asiainfo.com">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:sendFailed>
   <cp_id xsi:type="xsd:int">0</cp_id>
   <serviceid xsi:type="xsd:int">0</serviceid>
   <usernumber xsi:type="xsd:string"></usernumber>
   <content xsi:type="xsd:string"></content>
  </ns1:sendFailed>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
